// https://learn.javascript.ru/polyfills

// Чтобы современные функции поддерживались в старых движках, нам надо установить транспилер и добавить полифил
  // Чаще всего такая необходимость возникает для поддержки устаревших браузеров

// Транспилер переписывает современный JavaScript-код в предыдущий стандарт.
  // Babel - лидер среди транспилеров ( https://babeljs.io/ )

// Полифил - скрипт «заполняющий» пробелы и добавляющий современные функции.
  // core js - полифил, поддерживает много функций, можно подключать только нужные. ( https://github.com/zloirock/core-js )
  // polyfill.io – сервис, который автоматически создаёт скрипт с полифилом в зависимости от необходимых функций и браузера пользователя. ( https://polyfill.io/ )
