// Забыл сохранить код =(

// Task 1
// Дается массив чисел и число. нужно разделить массив на подмассивы размера числа
// [1, 2, 3, 4, 5, 6, 7, 8, 9, 10], 3 => [[1, 2, 3], [4, 5, 6], [7, 8, 9], [10]]
// Итерировал i в for(;;i+=size), внутри .slice(i, i+size)


// Task 2
// Создать функцию, в которую будет передаваться число. Число обозначает этаж треугольника паскаля. 
// Функция должна возвращать массив из всех этажей треугольника 5 => [[1], [1, 1], [1, 2, 1], [1, 3, 3, 1], [1, 4, 6, 4, 1]
// Решал через 2 цикла. Надо решить через рекурсию