// Practice

// Task 1
// Создайте переменные a=10 и b=2. Выведите на экран их сумму, разность, произведение и частное (результат деления).
let a = 10, b = 2
console.log(a+b, a-b, a*b, a/b)

// Task 2
// Создайте переменные c=15 и d=2. Просуммируйте их, а результат присвойте переменной result. Выведите на экран значение переменной result.
let c = 15, d = 2
let result = c + d
console.log(result)

// Task 3
// Создайте переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c.
// Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result.
// Выведите на экран значение переменной result.
let a2=17, b2=10, c2=a2-b2, d2=7, result2=c2+d2
console.log(result2) 
