// https://code.mu/ru/javascript/book/prime/inbuilt/array/
// Методы массива учебник Трепачёва


// Task 1
// Дан следующий массив:
const arr1 = [1, 2, 3];
// Добавьте ему в конец элементы 4, 5, 6.
console.log();    // Output: 


// Task 2
// Дан следующий массив:
const arr2 = [1, 2, 3];
// Добавьте ему в начало элементы 4, 5, 6.
console.log();    // Output: 


// Task 3
// Дан следующий массив:
const arr3 = [1, 2, 3];
// Выведите на экран первый элемент этого массива.
console.log();    // Output: 


// Task 4
// Дан следующий массив:
const arr4 = [1, 2, 3];
// Выведите на экран последний элемент этого массива.
console.log();    // Output: 


// Task 5
// Дан следующий массив:
const arr5 = [1, 2, 3, 4, 5];
// Сделайте из этого массива следующий: [1, 2, 3]
console.log();    // Output: 


// Task 6
// Дан следующий массив:
const arr6 = [1, 2, 3, 4, 5];
// Используя этот массив, запишите в новую переменную следующий массив: [4, 5]
console.log();    // Output: 


// Task 7
// Дан следующий массив:
const arr7 = [1, 2, 3, 4, 5];
// С помощью метода splice преобразуйте массив в следующий: [1, 4, 5]
console.log();    // Output: 


// Task 8
// Дан следующий массив:
const arr8 = [1, 2, 3, 4, 5];
// С помощью метода splice сделайте из него массив: [1, 2, 3, 'a', 'b', 'c', 4, 5]
console.log();    // Output: 


// Task 9
// Дан следующий массив:
const arr9 = [1, 2, 3, 4, 5];
// С помощью метода splice сделайте из него массив: [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']
console.log();    // Output: 


// Task 10
// Дан следующий массив:
const arr10 = [1, 2, 3, 4, 5];
// Найдите позицию числа 3 в этом массиве.
console.log();    // Output: 


// Task 1
// Дан следующий массив:
const arr11 = [1, 2, 3, 4, 5];
// Проверьте, есть ли в этом массиве число 3.
console.log();    // Output: 